Table of Contents
 Class ConversionDictionary<TKey>
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public abstract class ConversionDictionary<TKey> : SerializableDictionary<TKey, int>, IDictionary<TKey, int>, ICollection<KeyValuePair<TKey, int>>, IDictionary, ICollection, IReadOnlyDictionary<TKey, int>, IReadOnlyCollection<KeyValuePair<TKey, int>>, IEnumerable<KeyValuePair<TKey, int>>, IEnumerable, IDeserializationCallback, IXmlSerializable, ISerializable
Type Parameters
TKey
Inheritance
object
Dictionary<TKey, int>
SerializableDictionary<TKey, int>
ConversionDictionary<TKey>
Implements
IDictionary<TKey, int>
ICollection<KeyValuePair<TKey, int>>
IDictionary
ICollection
IReadOnlyDictionary<TKey, int>
IReadOnlyCollection<KeyValuePair<TKey, int>>
IEnumerable<KeyValuePair<TKey, int>>
IEnumerable
IDeserializationCallback
IXmlSerializable
ISerializable
Derived
ConversionDictionaryInt
ConversionDictionaryString
Inherited Members
 SerializableDictionary<TKey, int>.ValueSerializer
 Dictionary<TKey, int>.Add(TKey, int)
 Dictionary<TKey, int>.Clear()
 Dictionary<TKey, int>.ContainsKey(TKey)
 Dictionary<TKey, int>.ContainsValue(int)
 Dictionary<TKey, int>.GetEnumerator()
 Dictionary<TKey, int>.GetObjectData(SerializationInfo, StreamingContext)
 Dictionary<TKey, int>.OnDeserialization(object)
 Dictionary<TKey, int>.Remove(TKey)
 Dictionary<TKey, int>.TryGetValue(TKey, out int)
 Dictionary<TKey, int>.Comparer
 Dictionary<TKey, int>.Count
 Dictionary<TKey, int>.Keys
 Dictionary<TKey, int>.Values
 Dictionary<TKey, int>.this[TKey]
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 GetExEntityId(TKey)
public int GetExEntityId(TKey name)
Parameters
name TKey
Returns
int
 GetKey(int)
protected abstract TKey GetKey(int id)
Parameters
id int
Returns
TKey
 GetKey(string)
protected abstract TKey GetKey(string name)
Parameters
name string
Returns
TKey
 GetSaveKey(int)
public abstract TKey GetSaveKey(int Id)
Parameters
Id int
Returns
TKey
 InitMerge(IList<ProjectItem>)
public void InitMerge(IList<ProjectItem> source)
Parameters
source IList<ProjectItem>
 MapId(TKey)
public int MapId(TKey key)
Parameters
key TKey
Returns
int
 Merge(IList<ProjectItem>)
public void Merge(IList<ProjectItem> source)
Parameters
source IList<ProjectItem>
 Edit this page